app/views/questions/index.html.erb

    <%= @questions.count %>
    <%= inclination(@questions.count, 'question', 'questions', 'questions') %>
---
SELECT "questions".* FROM "questions"
SELECT COUNT(*) FROM "questions"