app/controllers/questions_controller.rb

  def create
     @question = Question.create(question_params)
---
INSERT INTO "questions" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "w"], ["user_id", 0], ["created_at", "2022-12-20 10:12:16.536408"], ["updated_at", "2022-12-20 10:12:16.536408"]]

  def update
    @question.update(question_params)
---
UPDATE "questions" SET "body" = ?, "user_id" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["body", "vvwvwvwv11"], ["user_id", 182], ["updated_at", "2022-12-11 20:38:34.529301"], ["id", 5]]