app/controllers/sessions_controller.rb

  def create
    user_params = params.require(:session)

    user = User.find_by(email: user_params[:email])&.authenticate(user_params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "iv@test.ru"], ["LIMIT", 1]]