app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "nickname", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Jora"], ["nickname", "Jo2"], ["email", "2@2"], ["created_at", "2022-12-30 17:41:42.815475"], ["updated_at", "2022-12-30 17:41:42.815475"], ["password_digest", "[FILTERED]"]]

    def update
      @user = User.find(params[:id])

      if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "nickname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nickname", "ivan.dbs2"], ["updated_at", "2023-01-03 19:08:58.617419"], ["id", 5]]